cask_args appdir: "/Applications"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "heroku/brew"

# install apps from Mac App Store 
brew "mas"

mas "1Blocker", id: 1107421413
mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "BBEdit", id: 404009241
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Instapaper", id: 1481302432
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "PCalc", id: 403504866
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Screens", id: 1224268771
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Xcode", id: 497799835

# install non-MAS apps
cask "1password"
cask "aerial"
cask "appcleaner"
cask "backblaze"
cask "bartender"
cask "bbedit"
cask "dash"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "istat-menus"
cask "makemkv"
cask "netnewswire"
cask "quitter"
cask "sony-ps4-remote-play"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"

# install fonts
cask "font-cooper-hewitt"
cask "font-fira-code"

# install homebrew packages
brew "python"
brew "ffmpeg"
brew "handbrake"
brew "mkvtoolnix"
brew "mp4v2"
brew "mysql"
brew "n"
brew "node", link: false
brew "pipenv"
brew "ruby"
brew "youtube-dl"
brew "heroku/brew/heroku"
