tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
cask_args appdir: "/Applications"

# install homebrew packages
brew "python"
brew "ffmpeg"
brew "handbrake"
brew "mkvtoolnix"
brew "mp4v2"
# brew "mysql"
# brew "n"
brew "pipenv"
brew "ruby"
brew "youtube-dl"
brew "yt-dlp"

# install non-MAS apps
cask "appcleaner"
cask "backblaze"
cask "bartender"
cask "bbedit"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "istat-menus"
cask "makemkv"
cask "microsoft-edge"
cask "netnewswire"
cask "quitter"
cask "screens-connect"
cask "steam"
cask "superduper"
cask "visual-studio-code"
cask "vlc"

# install fonts
tap "homebrew/cask-fonts"

cask "font-cooper-hewitt"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# install apps from Mac App Store 
brew "mas"

mas "1Blocker", id: 1107421413
mas "1Password", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Darkroom", id: 953286746
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Instapaper", id: 1481302432
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "PCalc", id: 403504866
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Screens", id: 1224268771
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
